tcfshcrw/playground/ESP32_master/src/Main.cpp
        case sizeof(DAP_bridge_state_st) : 
          DAP_bridge_state_st * dap_bridge_state_local_ptr;
          dap_bridge_state_local_ptr = &dap_bridge_state_lcl;
          Serial.readBytes((char*)dap_bridge_state_local_ptr, sizeof(DAP_bridge_state_st));        
          // check if data is plausible          
          if ( dap_bridge_state_lcl.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_BRIDGE_STATE )
          { 
            structChecker = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_BRIDGE_STATE);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_bridge_state_lcl.payLoadHeader_.payloadType);
          }
          if ( dap_bridge_state_lcl.payLoadHeader_.version != DAP_VERSION_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_bridge_state_lcl.payLoadHeader_.version);
          }
              // checksum validation
          crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_lcl.payLoadHeader_)), sizeof(dap_bridge_state_lcl.payLoadHeader_) + sizeof(dap_bridge_state_lcl.payloadBridgeState_));
          if (crc != dap_bridge_state_lcl.payloadFooter_.checkSum)
          { 
            structChecker = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_bridge_state_lcl.payloadFooter_.checkSum);
          }
          // if checks are successfull, overwrite global configuration struct
          if (structChecker == true)
          {
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==1)
            {
              #ifdef ESPNow_Pairing_function
                Serial.println("[L]Bridge Pairing...");
                software_pairing_action_b=true;
              #endif
              #ifndef ESPNow_Pairing_function
                Serial.println("[L]Pairing command didn't supported");
              #endif
            }
            //action=2, restart
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==2)
            {
              Serial.println("[L]Bridge Restart");
              delay(1000);
              ESP.restart();
            }
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==3)
            {
              //aciton=3 restart into boot mode
              #ifdef Using_Board_ESP32S3
                Serial.println("[L]Bridge Restart into Download mode");
                delay(1000);
                REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                ESP.restart();
              #endif
              #ifdef Using_Board_ESP32
                Serial.println("[L]Command not supported ");
                delay(1000); 
              #endif

            }
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==4)
            {
              if(PedalUpdateIntervalPrint_trigger)
              {
                //aciton=4 print pedal update interval
                Serial.println("[L]Bridge debug mode off.");
                PedalUpdateIntervalPrint_trigger=false;
              }
              else
              {
                //aciton=4 print pedal update interval
                Serial.println("[L]Bridge debug mode on.");
                PedalUpdateIntervalPrint_trigger=true;
              }


            }
            

          }
          break;
        case sizeof(Basic_WIfi_info) : 
          Serial.println("[L]get basic wifi info");
          Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
          #ifdef OTA_Update
            if(_basic_wifi_info.device_ID==deviceID)
            {
              SSID=new char[_basic_wifi_info.SSID_Length+1];
              PASS=new char[_basic_wifi_info.PASS_Length+1];
              memcpy(SSID,_basic_wifi_info.WIFI_SSID,_basic_wifi_info.SSID_Length);
              memcpy(PASS,_basic_wifi_info.WIFI_PASS,_basic_wifi_info.PASS_Length);
              SSID[_basic_wifi_info.SSID_Length]=0;
              PASS[_basic_wifi_info.PASS_Length]=0;
              /*
              Serial.print("[L]SSID(uint)=");
              for(uint i=0; i<_basic_wifi_info.SSID_Length;i++)
              {
                Serial.print(_basic_wifi_info.WIFI_SSID[i]);
                Serial.print(",");
              }
              Serial.println(" ");
              Serial.print("[L]PASS(uint)=");
              for(uint i=0; i<_basic_wifi_info.PASS_Length;i++)
              {
                Serial.print(_basic_wifi_info.WIFI_PASS[i]);
                Serial.print(",");
              }
              Serial.println(" ");
              
              Serial.print("[L]SSID=");
              Serial.println(SSID);
              Serial.print("[L]PASS=");
              Serial.println(PASS);   
              */
              OTA_enable_b=true;
            }
            else
            {
              pedal_OTA_action_b=true;

            }
          #endif
          
          break;
        default:
        // flush the input buffer
          while (Serial.available()) 
            Serial.read();
            //Serial.flush();
            Serial.print("[L]In byte size: ");
            Serial.print(n);
            Serial.print("    Exp config size: ");
            Serial.print(sizeof(DAP_config_st) );
            Serial.print("    Exp action size: ");
            Serial.println(sizeof(DAP_actions_st) );

          break;          
      }
    }



    if(update_basic_state)
    {
      update_basic_state=false;
      Serial.write((char*)&dap_state_basic_st, sizeof(DAP_state_basic_st));
      Serial.print("\r\n");
      if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[dap_state_basic_st.payLoadHeader_.PedalTag]==0)
      {
        Serial.print("[L]Found Pedal:");
        Serial.println(dap_state_basic_st.payLoadHeader_.PedalTag);
      }
      dap_bridge_state_st.payloadBridgeState_.Pedal_availability[dap_state_basic_st.payLoadHeader_.PedalTag]=1;
      pedal_last_update[dap_state_basic_st.payLoadHeader_.PedalTag]=millis();

