tcfshcrw/playground/ESP32_master/src/Main.cpp
        }
        Serial.print("[L]sending:");
        print_struct_hex(&dap_bridge_state_st);
      }
      PedalUpdateIntervalPrint_b=false;
    }
    
    delay(2);
  }
}
unsigned long last_serial_joy_out =millis();
unsigned long now;
void Joystick_Task( void * pvParameters )
{
  for(;;)
  {   
    #ifdef USB_JOYSTICK
    if(IsControllerReady())
    {
      if(pedal_status==0)
      {
        SetControllerOutputValueAccelerator(pedal_cluth_value);
        SetControllerOutputValueBrake(pedal_brake_value);
        SetControllerOutputValueThrottle(pedal_throttle_value);
        SetControllerOutputValueRudder(0);
        SetControllerOutputValueRudder_brake(0,0);
      }
      if (pedal_status==1)
      {
        SetControllerOutputValueAccelerator(0);
        SetControllerOutputValueBrake(0);
        SetControllerOutputValueThrottle(0);
        //3% deadzone
        if(pedal_throttle_value<((int16_t)(0.47*JOYSTICK_RANGE))||pedal_throttle_value>((int16_t)(0.53*JOYSTICK_RANGE)))
        {
          SetControllerOutputValueRudder(JOYSTICK_RANGE-pedal_throttle_value);
        }
        else
        {
          SetControllerOutputValueRudder((int16_t)(0.5*JOYSTICK_RANGE));
        }
        SetControllerOutputValueRudder_brake(0,0);
        
      }
      if (pedal_status==2)
      {
        SetControllerOutputValueAccelerator(0);
        SetControllerOutputValueBrake(0);
        SetControllerOutputValueThrottle(0);
        SetControllerOutputValueRudder((int16_t)(0.5*JOYSTICK_RANGE));
        //int16_t filter_brake=0;
        //int16_t filter_throttle=0;
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]==1)
        {
          SetControllerOutputValueRudder_brake(pedal_cluth_value,pedal_throttle_value);
        }
        else
        {
          SetControllerOutputValueRudder_brake(pedal_brake_value,pedal_throttle_value);
        }
        
        
      }
      

      joystickSendState();
      //bool joystatus=GetJoystickStatus();
      if(!GetJoystickStatus())
      {
        RestartJoystick();
        Serial.println("[L]HID Error, Restart Joystick...");
        //last_serial_joy_out=millis();
      }
    }
    #endif
    // set analog value
    #ifdef Using_analog_output

      dacWrite(Analog_brk,(uint16_t)((float)((Joystick_value[1])/(float)(JOYSTICK_RANGE))*255));
      dacWrite(Analog_gas,(uint16_t)((float)((Joystick_value[2])/(float)(JOYSTICK_RANGE))*255));
    #endif
    //set MCP4728 analog value
    #ifdef Using_MCP4728
      //Serial.print("MCP/");
      now=millis();
      if(MCP_status)
      {
        /*
        if(now-last_serial_joy_out>1000)
        {
          Serial.print("MCP/");
          Serial.print(Joystick_value[0]);
          Serial.print("/");
          Serial.print(Joystick_value[1]);
          Serial.print("/");
          Serial.print(Joystick_value[2]); 
        }
        */
      
        mcp.setChannelValue(MCP4728_CHANNEL_A, (uint16_t)((float)Joystick_value[0]/(float)JOYSTICK_RANGE*0.8f*4096));
        mcp.setChannelValue(MCP4728_CHANNEL_B, (uint16_t)((float)Joystick_value[1]/(float)JOYSTICK_RANGE*0.8f*4096));
        mcp.setChannelValue(MCP4728_CHANNEL_C, (uint16_t)((float)Joystick_value[2]/(float)JOYSTICK_RANGE*0.8f*4096));
      }

    #endif
      delay(1);
  }
}

//OTA multitask
uint16_t OTA_count=0;
bool message_out_b=false;
bool OTA_enable_start=false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
void OTATask( void * pvParameters )
{

  for(;;)
  {
    #ifdef OTA_Update
      if(OTA_count>200)
      {
        message_out_b=true;
        OTA_count=0;
      }
      else
      {
        OTA_count++;
      }

      
      if(OTA_enable_b)
      {
        if(message_out_b)
        {
          message_out_b=false;
          Serial1.println("[L]OTA enable flag on");
        }
        if(OTA_status)
        {
          
          //server.handleClient();
        }
        else
        {
          Serial.println("[L]de-initialize espnow");
          Serial.println("[L]wait...");
          esp_err_t result= esp_now_deinit();
          ESPNow_initial_status=false;
          ESPNOW_status=false;
          delay(200);
          if(result==ESP_OK)
          {
            OTA_status=true;
            delay(1000);
            //ota_wifi_initialize(APhost);
            wifi_initialized(SSID,PASS);
            delay(2000);
            ESP32OTAPull ota;
            char* Version_tag;
            int ret;
            ota.SetCallback(OTAcallback);
            ota.OverrideBoard(BRIDGE_BOARD);
            Version_tag=BRIDGE_FIRMWARE_VERSION;
            if(_basic_wifi_info.wifi_action==1)
            {
              Version_tag="0.0.0";
              Serial.println("Force update");
            }
            switch (_basic_wifi_info.mode_select)
            {
              case 1:
                Serial.printf("[L]Flashing to latest Main, checking %s to see if an update is available...\n", JSON_URL_main);
                ret = ota.CheckForOTAUpdate(JSON_URL_main, Version_tag);
                Serial.printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                break;
              case 2:
                Serial.printf("[L]Flashing to latest Dev, checking %s to see if an update is available...\n", JSON_URL_dev);
                ret = ota.CheckForOTAUpdate(JSON_URL_dev, Version_tag);
                Serial.printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                break;
              default:
              break;
            }

            delay(3000);
          }

        }
      }
      
      //delay(2);
    #endif

    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( otaTask_stackSizeIdx_u32 == 1000)
      {
        UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        Serial.print("StackSize (OTA): ");
        Serial.println(stackHighWaterMark);
        otaTask_stackSizeIdx_u32 = 0;
      }
      otaTask_stackSizeIdx_u32++;
    #endif
    delay(2);
  }
}

//LED task
uint8_t LED_bright_index=0;
uint8_t LED_bright_direction=1;
void LED_Task( void * pvParameters)
{
  for(;;)
  {
    #ifdef LED_ENABLE_WAVESHARE
    //LED status update
      if(LED_Status==0)
      {
        if(LED_bright_index>30)
        {
          LED_bright_direction=-1;
        }
        if(LED_bright_index<2)
        {
          LED_bright_direction=1;
        }
        LED_bright_index=LED_bright_index+LED_bright_direction;
        pixels.setBrightness(LED_bright_index);
        uint8_t led_status=dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]+dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1]*2+dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2]*4;
        switch (led_status)
        {
          case 0:
            pixels.setPixelColor(0,0xff,0xff,0xff);
            //pixels.setPixelColor(0,0x52,0x00,0xff);//Orange
            pixels.show();
            break;
          case 1:
            pixels.setPixelColor(0,0xff,0x00,0x00);//Red
            pixels.show();
            break;
          case 2:
            pixels.setPixelColor(0,0xff,0x0f,0x00);//Orange
            pixels.show();
            break;
          case 3:
            pixels.setPixelColor(0,0x52,0x00,0xff);//Cyan
            pixels.show();
            break; 
          case 4:
            pixels.setPixelColor(0,0x5f,0x5f,0x00);//Yellow
            pixels.show();
            break;
          case 5:
            pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
            pixels.show();
            break;      
          case 6:
            pixels.setPixelColor(0,0x00,0xff,0x00);//Green
            pixels.show();
            break;  
          case 7:
            pixels.setPixelColor(0, 0x80, 0x00, 0x80);//Purple
            pixels.show();
            break;                                         
          default:
            break;
        }
        delay(150);           
      }
      if(LED_Status==1)//pairing
      {
        
        //delay(1000);
        pixels.setPixelColor(0,0xff,0x00,0x00);//Red       
        pixels.setBrightness(25);
        pixels.show();
        delay(500);
        pixels.setPixelColor(0,0x00,0x00,0x00);//fill no color      
        //pixels.setBrightness(0);
        pixels.show();
        delay(500);
      }
      
    #endif  
    delay(10);
  }
}

void LED_Task_Dongle( void * pvParameters)
{
  for(;;)
  {
    #ifdef LED_ENABLE_DONGLE
    //LED status update
      if(LED_Status==0)
      {
        if(LED_bright_index>30)
        {
          LED_bright_direction=-1;
        }
        if(LED_bright_index<2)
        {
          LED_bright_direction=1;
        }
        LED_bright_index=LED_bright_index+LED_bright_direction;
        pixels.setBrightness(LED_bright_index);

        for(uint i=0;i<3;i++)
        {
          if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[i]==1)
          {
            pixels.setPixelColor(i,0xff,0x0f,0x00);//Orange
          }
          else
          {
            pixels.setPixelColor(i,0xff,0xff,0xff);//White
          }            
        }
        pixels.show();
        
        delay(150);           
      }
      if(LED_Status==1)//pairing
      {
        
        //delay(1000);
        for(uint i=0;i<3;i++)
        {
          pixels.setPixelColor(i,0xff,0x00,0x00);//Red  
        }
             
        pixels.setBrightness(25);
        pixels.show();
        delay(500);
        for(uint i=0;i<3;i++)
        {
          pixels.setPixelColor(i,0x00,0x00,0x00);//fill no color  
        }
           
        //pixels.setBrightness(0);
        pixels.show();
        delay(500);
      }
      
    #endif  
    delay(10);
  }
}


void FanatecUpdate(void * pvParameters) 
{
  for(;;)
  {
    #ifdef Fanatec_comunication
      fanatec.communicationUpdate();
      if (fanatec.isPlugged()) {
        uint16_t throttleValue = pedal_throttle_value;
        uint16_t brakeValue = pedal_brake_value;
        uint16_t clutchValue = pedal_cluth_value;
        uint16_t handbrakeValue = 0;             // Set if needed

        // Pedal input values to 0 - 10000
        throttleValue = map(throttleValue, 0, 10000, 0, 65535);
        brakeValue = map(brakeValue, 0, 10000, 0, 22000);
        clutchValue = map(clutchValue, 0, 10000, 0, 65535);

        // Set pedal values in FanatecInterface
        fanatec.setThrottle(throttleValue);
        fanatec.setBrake(brakeValue);
        fanatec.setClutch(clutchValue);
        fanatec.setHandbrake(handbrakeValue);
        
        fanatec.update();
      }
    #endif
    delay(10);
  }
}















